// 4.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

/*
Напишите функцию, решающую задачу о максимальном
паросочетании (варианты графов в виде списка рёбер указаны в
таблице 4.1).

Таблица 4.1. Список рёбер для пункта 4.2 (номер строки соответствует
индексу вершины в левой доле, содержимое строки – индексы вершины
в правой доле, с которыми соответствующая вершина левой доли
связана ребром)

Вариант 18.
Список рёбер

{ 3,4,5,
  7,
  5,
  5,6,7
}

*/

#include <iostream>

using namespace std;

int main()
{
	cout << "Hello World!\n";
}